app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "email", "country_id", "city_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["first_name", "1"], ["last_name", "1"], ["email", "1"], ["country_id", 1], ["city_id", 1], ["created_at", "2018-03-20 13:03:52.850618"], ["updated_at", "2018-03-20 13:03:52.850618"]]
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def find_by_id
    @user = User.find(params[:id])